Revit 2025 API
LoadClassification Enumeration
 An enumerated type to list all demand factor classifications.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum LoadClassification
Public Enumeration LoadClassification
public enum class LoadClassification
type LoadClassification
Members
Member name | Value | Description
Undefined | 0 |  Load classification is undefined.
Power | 1 |  Load classification is power.
Lighting | 2 |  Load classification is Lighting.
Hvac | 3 |  Load classification is HVAC.
See Also
Reference
Autodesk.Revit.DB.Electrical Namespace